STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE_Thread/BLE_HeartRate_Thread/STM32_WPAN/App/app_thread.c
    case ERR_THREAD_SET_NETWORK_KEY :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_NETWORK_KEY ",ErrCode);
        break;

    case ERR_THREAD_CHECK_WIRELESS :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
        break;

    case ERR_THREAD_SET_THRESHOLD:
        APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_THRESHOLD", ErrCode);
        break;

    /* USER CODE BEGIN APP_THREAD_Error_2 */
    case ERR_THREAD_COAP_START :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_START ",ErrCode);
        break;

    case ERR_THREAD_COAP_ADD_RESSOURCE :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_ADD_RESSOURCE ",ErrCode);
        break;

    case ERR_THREAD_MESSAGE_READ :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_MESSAGE_READ ",ErrCode);
        break;

    case ERR_THREAD_COAP_SEND_RESPONSE :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_RESPONSE ",ErrCode);
        break;

    case ERR_THREAD_COAP_APPEND :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_APPEND ",ErrCode);
        break;

    case ERR_THREAD_COAP_SEND_REQUEST :
        APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_REQUEST ",ErrCode);
        break;

    case ERR_THREAD_MSG_COMPARE_FAILED:
        APP_THREAD_TraceError("ERROR : ERR_THREAD_MSG_COMPARE_FAILED ",ErrCode);
        break;
        
    /* USER CODE END APP_THREAD_Error_2 */
    default :
        APP_THREAD_TraceError("ERROR Unknown ", 0);
        break;
  }
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pContext);

  /* USER CODE BEGIN APP_THREAD_STATENOTIF */

  /* USER CODE END APP_THREAD_STATENOTIF */

  if ((NotifFlags & (uint32_t)OT_CHANGED_THREAD_ROLE) == (uint32_t)OT_CHANGED_THREAD_ROLE)
  {
    switch (otThreadGetDeviceRole(PtOpenThreadInstance))
    {
      case OT_DEVICE_ROLE_DISABLED:
          /* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */
      	  APP_LED_OFF(LD2);
          APP_LED_OFF(LD3);
#ifdef APP_THREAD_PERIODIC_TRANSMIT
          /* Stop timer for periodic CoAp msg transmission */
          UTIL_TIMER_Stop(&APP_Thread_transmitTimerId);
          LOG_INFO_APP("INFO: PERIODIC_TRANSMIT timer stopped");
          CounterRole++;
          LOG_INFO_APP("INFO: Role is DISABLED. CounterRole value = %d",CounterRole);

#endif
          /* USER CODE END OT_DEVICE_ROLE_DISABLED */
          break;

      case OT_DEVICE_ROLE_DETACHED:
          /* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */
          APP_LED_OFF(LD2);
          APP_LED_OFF(LD3);
#ifdef APP_THREAD_PERIODIC_TRANSMIT
          /* Stop timer for periodic CoAp msg transmission */
          UTIL_TIMER_Stop(&APP_Thread_transmitTimerId);
          LOG_INFO_APP("INFO: PERIODIC_TRANSMIT timer stopped");
          CounterRole++;
          LOG_INFO_APP("INFO: Role is DETACHED. CounterRole value = %d",CounterRole);
#endif
          /* USER CODE END OT_DEVICE_ROLE_DETACHED */
          break;

      case OT_DEVICE_ROLE_CHILD:
          /* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
          APP_LED_OFF(LD2);
          APP_LED_ON(LD3);
#ifdef APP_THREAD_PERIODIC_TRANSMIT  
          /* If timer for periodic CoAp msg transmission NOT running */
          if (UTIL_TIMER_IsRunning(&APP_Thread_transmitTimerId) == 0U)
          {
            /* Start timer for periodic CoAp msg transmission */
            UTIL_TIMER_StartWithPeriod(&APP_Thread_transmitTimerId, APP_Thread_TransmitPeriod_ms);
            LOG_INFO_APP("INFO: PERIODIC_TRANSMIT timer started");
          }
          CounterRole++;
          LOG_INFO_APP("INFO: Role is CHILD. CounterRole value = %d",CounterRole);
#endif
          /* USER CODE END OT_DEVICE_ROLE_CHILD */
          break;

      case OT_DEVICE_ROLE_ROUTER :
          /* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
          APP_LED_OFF(LD2);
          APP_LED_ON(LD3);
#ifdef APP_THREAD_PERIODIC_TRANSMIT  
          /* If timer for periodic CoAp msg transmission NOT running */
          if (UTIL_TIMER_IsRunning(&APP_Thread_transmitTimerId) == 0U)
          {
            /* Start timer for periodic CoAp msg transmission */
            UTIL_TIMER_StartWithPeriod(&APP_Thread_transmitTimerId, APP_Thread_TransmitPeriod_ms);
            LOG_INFO_APP("INFO: PERIODIC_TRANSMIT timer started");
          }
          CounterRole++;
          LOG_INFO_APP("INFO: Role is ROUTER. CounterRole value = %d",CounterRole);
#endif
          /* USER CODE END OT_DEVICE_ROLE_ROUTER */
          break;

      case OT_DEVICE_ROLE_LEADER :
          /* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */
          APP_LED_ON(LD2);
          APP_LED_OFF(LD3);
#ifdef APP_THREAD_PERIODIC_TRANSMIT  
          /* If timer for periodic CoAp msg transmission NOT running */
          if (UTIL_TIMER_IsRunning(&APP_Thread_transmitTimerId) == 0U)
          {
            /* Start timer for periodic CoAp msg transmission */
            UTIL_TIMER_StartWithPeriod(&APP_Thread_transmitTimerId, APP_Thread_TransmitPeriod_ms);
            LOG_INFO_APP("INFO: PERIODIC_TRANSMIT timer started");
          }
          CounterRole++;
          LOG_INFO_APP("INFO: Role is LEADER. CounterRole value = %d",CounterRole);
#endif
          /* USER CODE END OT_DEVICE_ROLE_LEADER */
          break;

      default:
          /* USER CODE BEGIN DEFAULT */
          APP_LED_OFF(LD2);
          APP_LED_OFF(LD3);
          /* USER CODE END DEFAULT */
          break;
    }
  }
}

#if (OT_CLI_USE == 1)
/* OT CLI UART functions */
static void APP_THREAD_ProcessUart(void)
{
  arcUartProcess();
}

void APP_THREAD_ScheduleUART(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_OT_UART, TASK_PRIO_UART);
}

static void APP_THREAD_CliInit(otInstance *aInstance)
{
  UTIL_SEQ_RegTask(1 << CFG_TASK_OT_UART, UTIL_SEQ_RFU, APP_THREAD_ProcessUart);
  /* run first time */
  UTIL_SEQ_SetTask(1U << CFG_TASK_OT_UART, TASK_PRIO_UART);

  (void)otPlatUartEnable();
  otCliInit(aInstance, CliUartOutput, aInstance);
}
#endif /* OT_CLI_USE */

/**
 * @brief  Thread persistence startup
 * @param  None
 * @retval None
 */
static void APP_THREAD_PersistenceStartup(void)
{
  /* USER CODE BEGIN APP_THREAD_PersistenceStartup */

